package rumorph

import "testing"

type tcase struct {
	Input  string
	Output string
}

func TestLocative_generate(t *testing.T) {
	cases := []tcase{
		{"Берлин", "Берлине"},
		{"Москва", "Москве"},
		{"Варшава", "Варшаве"},
		{"Токио", "Токио"},
		{"Ивдель", "Ивделе"},
		{"Припять", "Припяти"},
		{"Германия", "Германии"},
		{"Нижняя Саксония", "Нижней Саксонии"},
		{"Саксония-анхальт", "Саксонии-анхальт"},
		{"Санкт-Петербург", "Санкт-Петербурге"},
		{"Ростов-на-Дону", "Ростове-на-Дону"},
		{"Франкфурт-на-Майне", "Франкфурте-на-Майне"},
		{"Нижний Новгород", "Нижнем Новгороде"},
		{"Кабо-верде", "Кабо-верде"},
		{"Солт-лейк-сити", "Солт-лейк-сити"},
		{"Левое Сорокино", "Левом Сорокино"},
		{"Новгород Великий", "Новгороде Великом"},
		{"Красное Село", "Красном Селе"},
		{"Северный Рейн-Вестфалия", "Северном Рейне-Вестфалии"},
		{"Мекленбург-Верхняя Померания", "Мекленбурге-Верхней Померании"},
		{"Папуа — Новая Гвинея", "Папуа — Новой Гвинее"},
		{"Свердловск 16", "Свердловске 16"},
		{"Карлсруэ", "Карлсруэ"},
	}

	for _, c := range cases {
		r, err := Locative(c.Input)
		if err != nil {
			t.Error(err.Error())
		}
		if r != c.Output {
			t.Errorf("%s != %s", r, c.Output)
		}
	}
}
